#set_false_path -to [get_pins [list fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async0_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async1_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async2_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async3_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async4_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async0_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async1_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async2_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async3_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async4_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async0_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async1_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async2_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async3_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async4_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async0_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async1_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async2_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async3_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async4_reg/PRE]]
#set_false_path -to [get_pins [list fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async0_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async1_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async2_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async3_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async4_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async0_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async1_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async2_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async3_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async4_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async0_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async1_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async2_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async3_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async4_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async0_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async1_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async2_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async3_reg/PRE #          fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async4_reg/PRE]]
#set_false_path -to [get_pins {fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async0_reg/PRE fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async1_reg/PRE fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async2_reg/PRE fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async3_reg/PRE fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/rd_reset_gen/reset_async4_reg/PRE fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async0_reg/PRE fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async1_reg/PRE fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async2_reg/PRE fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async3_reg/PRE fifo_block_i/ethernet_mac_fifo_i/i_tx_fifo/wr_reset_gen/reset_async4_reg/PRE fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async0_reg/PRE fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async1_reg/PRE fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async2_reg/PRE fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async3_reg/PRE fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/rd_reset_gen/reset_async4_reg/PRE fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async0_reg/PRE fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async1_reg/PRE fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async2_reg/PRE fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async3_reg/PRE fifo_block_i/ethernet_mac_fifo_i/rx_fifo_inst/wr_reset_gen/reset_async4_reg/PRE}]
## PART is kintexu xcku060ffva1156-2
#
#
########################################################
## Clock/period constraints                            #
########################################################
## Main transmit clock/period constraints
#
#create_clock -period 5.000 [get_ports clk_in_p]
#set_input_jitter clk_in_p 0.050
#
########################################################
## Synchronizer False paths
########################################################
#set_false_path -to [get_cells -hierarchical -filter {NAME =~ reset_error_sync_reg*sync1_r_reg[0]}]
#set_false_path -to [get_cells -hierarchical -filter {NAME =~ gen_enable_sync/sync1_r_reg[0]}]
#
########################################################
## FIFO level constraints
########################################################
#
#set_false_path -from [get_cells fifo_block_i/ethernet_mac_fifo_i/*/wr_store_frame_tog_reg] -to [get_cells fifo_block_i/ethernet_mac_fifo_i/*/*/sync1_r_reg*]
#set_max_delay -datapath_only -from [get_cells {fifo_block_i/ethernet_mac_fifo_i/*/rd_addr_gray_reg_reg[*]}] -to [get_cells fifo_block_i/ethernet_mac_fifo_i/*/*/sync1_r_reg*] 6.400
#set_false_path -to [get_pins -filter {NAME =~ */PRE} -of_objects [get_cells fifo_block_i/ethernet_mac_fifo_i/*/*/reset_async*_reg]]
#
########################################################
## I/O constraints                                     #
########################################################
#
## These inputs can be connected to dip switches or push buttons on an
## appropriate board.
#
#set_false_path -from [get_ports reset]
#set_false_path -from [get_ports reset_error]
#set_false_path -from [get_ports insert_error]
#set_false_path -from [get_ports pcs_loopback]
#set_false_path -from [get_ports enable_pat_gen]
#set_false_path -from [get_ports enable_pat_check]
#set_false_path -from [get_ports enable_custom_preamble]
#set_case_analysis 0 [get_ports sim_speedup_control]
#
## These outputs can be connected to LED's or headers on an
## appropriate board.
#
#set_false_path -to [get_ports core_ready]
#set_false_path -to [get_ports coreclk_out]
#set_false_path -to [get_ports qplllock_out]
#set_false_path -to [get_ports frame_error]
#set_false_path -to [get_ports gen_active_flash]
#set_false_path -to [get_ports check_active_flash]
#set_false_path -to [get_ports serialized_stats]
#
#
#set_property IOSTANDARD LVCMOS33 [get_ports check_active_flash]
#set_property IOSTANDARD LVCMOS33 [get_ports core_ready]
#set_property IOSTANDARD LVCMOS33 [get_ports enable_custom_preamble]
#set_property IOSTANDARD LVCMOS33 [get_ports enable_pat_gen]
#set_property IOSTANDARD LVCMOS33 [get_ports frame_error]
#set_property IOSTANDARD LVCMOS33 [get_ports gen_active_flash]
#set_property IOSTANDARD LVCMOS33 [get_ports insert_error]
#set_property IOSTANDARD LVCMOS33 [get_ports pcs_loopback]
#set_property IOSTANDARD LVCMOS33 [get_ports qplllock_out]
#set_property IOSTANDARD LVCMOS33 [get_ports reset_error]
#set_property IOSTANDARD LVCMOS33 [get_ports serialized_stats]
#set_property IOSTANDARD LVCMOS33 [get_ports sim_speedup_control]
#set_property IOSTANDARD LVCMOS33 [get_ports enable_pat_check]
#set_property IOSTANDARD LVCMOS33 [get_ports coreclk_out]
#set_property IOSTANDARD LVCMOS33 [get_ports reset]
#
#set_property IOSTANDARD DIFF_SSTL18_I [get_ports clk_in_n]
#set_property IOSTANDARD DIFF_SSTL18_I [get_ports clk_in_p]
#set_property PACKAGE_PIN N21 [get_ports coreclk_out]
#set_property PACKAGE_PIN N22 [get_ports reset]
#set_property PACKAGE_PIN K20 [get_ports check_active_flash]
#set_property PACKAGE_PIN Y23 [get_ports clk_in_p]
#set_property PACKAGE_PIN K21 [get_ports core_ready]
#set_property PACKAGE_PIN R22 [get_ports enable_custom_preamble]
#set_property PACKAGE_PIN M21 [get_ports frame_error]
#set_property PACKAGE_PIN M20 [get_ports gen_active_flash]
#set_property PACKAGE_PIN P20 [get_ports insert_error]
#set_property PACKAGE_PIN P21 [get_ports pcs_loopback]
#set_property PACKAGE_PIN L20 [get_ports qplllock_out]
#set_property PACKAGE_PIN M22 [get_ports reset_error]
#set_property PACKAGE_PIN R21 [get_ports serialized_stats]

